# MODULE: Строки

# BLOCK: Интерфейс

about = 'Программа для учета успеваемости учащихся\n'
main_menu = '''
Меню программы:

1. Информация об учащихся
2. Работа с оценками
3. Изучаемые дисциплины
4. Средний балл учащихся
5. Выход из программы
'''

header_1 = 'Информация об учащихся\n'
menu_1 = '''
1. Добавить нового учащегося
2. Изменить данные учащегося
3. Выход

'''

header_2 = 'Работа с оценками\n'
menu_2 = '''
1. Добавить новую оценку
2. Показать в хронологическом порядке список полученных учеником оценок с указанием предмета
3. Список оценок учащегося, полученных в указанный интервал дат
4. Список аттестованных учеников в указанный период времени
5. Выход

'''

header_3 = 'Изучаемые дисциплины\n'
menu_3 = '''
1. Добавить новый предмет
2. Изменить существующий предмет
3. Выход

'''

header_4 = 'Средний балл учащихся\n'
menu_4 = '''
1. Показать средний балл учащегося по конкретному предмету
2. Показать учащихся, имеющих средний балл по предмету выше указанного
3. Выход

'''

# BLOCK: ERROR

error_empty = 'ОШИБКА: ничего не было введено.\n'
error_nodigit = 'ОШИБКА: необходимо ввести число.\n'
error_wrong = 'ОШИБКА: введено неверное значение.\n'